/**
 * ********************************
 *      MATH NEED FOR PROGRAMMING 
 * ********************************
 * 1. Number: +ve, -ve, 0, [50, -9, 0]
 * 2. integer: 2, 88, 100, [odd, even]
 * 3. float: 5.6, 2.2
 * 4. operation: +, -, *, /
 * 5. More operation: % [reminder/modulo] ভাগশেষ থাকাতে বলা হয়।
 * 6. Percentage: 5%, 100 এর ৫% কতো? Percentage সম্পর্কে জানতে হবে।
 * 7. sum: সমষ্টি সম্পর্কে জানতে হবে। যেমন 20, 30, 40 এই ৩ অংকের সমষ্টি কতো?
 * 8. Average : Average সম্পর্কে জানতে হবে।
 * 9. ঐকিক নিয়ম সম্পর্কে জানতে হবে। 
 * 10. MAX-MIN : বড় সংখ্যা ছোট সংখ্যার পার্থক্য সম্পর্কে জানতে হবে।
 * 11. Series: ধারাপদ সম্পর্কে জানতে হবে। যেমন ১-১০ পর্যন্ত সংখ্যা গুলো চাই, এর মধ্যে বিজোর বা জোর গুলো চাই ইত্যাদি।
 * 12. Area: Triangle, Circle etc. formula দিলে মান বের করতে পারা।
 * 13. 
 */